---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeIterator.IsDone
source: html/1f4bd888-f003-5697-70e2-790916f7edf5.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.